app/controllers/sessions_controller.rb

  def create
    # authenticate that user/pass combo is legit
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'taff.russell@gmail.com' LIMIT 1